src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы/Forms/ФормаСпискаНовая/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивРазделовОтбора") Тогда
		ЭтотОбъект.СписокРазделовОтбора.ЗагрузитьЗначения(Параметры.МассивРазделовОтбора);
	КонецЕсли;
	
	СформироватьДинамическиеЭлементыВнешнихСистем();
	Элементы.РазделДляКопирования.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанаВнешняяСистема" Тогда
		ДобавитьЭлементыВнешнейСистемы(Параметр.ВнешняяСистема, ПолучитьРазделВнешнейСистемы(Параметр.ТипВнешнейСистемы));
		ОбновитьЗаголовкиЭлементов(Параметр.ВнешняяСистема);
	ИначеЕсли ИмяСобытия = "УдаленаВнешняяСистема" Тогда
   		УдалитьЭлементыВнешнейСистемы(Параметр.ВнешняяСистема, ПолучитьРазделВнешнейСистемы(Параметр.ТипВнешнейСистемы));
		СформироватьДинамическиеЭлементыВнешнихСистем();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ДобавитьВнешнююСистему(Команда)
	
	ПараметрыОткрытия = Новый Структура("МассивРазделовОтбора", ЭтотОбъект.СписокРазделовОтбора.ВыгрузитьЗначения());
	ОткрытьФорму("Справочник.ВнешниеСистемы.Форма.ФормаДобавленияВнешнейСистемы", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ОткрытьНастройкиВнешнейСистемы(Команда)
	
	ДанныеВнешнейСистемы = ПолучитьДанныеВСПоИмениЭлемента(ЭтотОбъект.ТекущийЭлемент.Имя);
	
	Если ЗначениеЗаполнено(ДанныеВнешнейСистемы) Тогда
		ОткрытьФорму("Справочник.ВнешниеСистемы.ФормаОбъекта", Новый Структура("Ключ", ДанныеВнешнейСистемы.ВнешняяСистема),,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура УдалитьВнешнююСистему(Команда)
	
	ДанныеВнешнейСистемы = ПолучитьДанныеВСПоИмениЭлемента(ЭтотОбъект.ТекущийЭлемент.Имя);
	
	Если ЗначениеЗаполнено(ДанныеВнешнейСистемы) Тогда
		
		ПараметрыОповещения	 = Новый Структура("ДанныеВнешнейСистемы, Действие", ДанныеВнешнейСистемы, "Удалить");
		ОписаниеОповещения	 = Новый ОписаниеОповещения("ПослеВопросаОбУдаленииОтключении", ЭтотОбъект, ПараметрыОповещения);
		Если ПолучитьЗначениеРеквизитаВнешнейСистемы(ДанныеВнешнейСистемы.ВнешняяСистема, "ПометкаУдаления") = Истина Тогда
			ТекстВопроса = СтрШаблон(НСтр("ru = 'Снять с ""%1"" пометку на удаление?'"), Строка(ДанныеВнешнейСистемы.ВнешняяСистема));
		Иначе
			ТекстВопроса = СтрШаблон(НСтр("ru = 'Пометить ""%1"" на удаление?'"), Строка(ДанныеВнешнейСистемы.ВнешняяСистема));
		КонецЕсли;
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ОтключитьВнешнююСистему(Команда)
	
	ДанныеВнешнейСистемы = ПолучитьДанныеВСПоИмениЭлемента(ЭтотОбъект.ТекущийЭлемент.Имя);
	
	Если ЗначениеЗаполнено(ДанныеВнешнейСистемы) Тогда
		
		ПараметрыОповещения	 = Новый Структура("ДанныеВнешнейСистемы, Действие", ДанныеВнешнейСистемы, "Отключить");
		ОписаниеОповещения	 = Новый ОписаниеОповещения("ПослеВопросаОбУдаленииОтключении", ЭтотОбъект, ПараметрыОповещения);
		Если ПолучитьЗначениеРеквизитаВнешнейСистемы(ДанныеВнешнейСистемы.ВнешняяСистема, "Используется") = Истина Тогда
			ТекстВопроса = СтрШаблон(НСтр("ru = 'Внешняя система будет отмечена неиспользуемой. Отключить ""%1""?'"), Строка(ДанныеВнешнейСистемы.ВнешняяСистема));
		Иначе
			ТекстВопроса = СтрШаблон(НСтр("ru = 'Внешняя система будет отмечена используемой. Включить ""%1""?'"), Строка(ДанныеВнешнейСистемы.ВнешняяСистема));
		КонецЕсли;	
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СозданиеДинамическихЭлементовФормы

&НаСервере
// Процедура, добавляет на форму динамические элементы внешних систем.
//
Процедура СформироватьДинамическиеЭлементыВнешнихСистем()
	
	МассивВС = ПолучитьВнешниеСистемы();
	
	Для Каждого ВнешняяСистема Из МассивВС Цикл 
		Если ВнешняяСистема.ТипВнешнейСистемы <> Перечисления.ТипыВнешнихСистем.МобильноеПриложениеУправляющего Тогда
			ДобавитьЭлементыВнешнейСистемы(ВнешняяСистема, ПолучитьРазделВнешнейСистемы(ВнешняяСистема.ТипВнешнейСистемы));  
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет на форму динамические элементы внешних систем.
//
Процедура ДобавитьЭлементыВнешнейСистемы(ВнешняяСистема, Раздел)
	
	Если СписокРазделовОтбора.Количество() > 0 И СписокРазделовОтбора.НайтиПоЗначению(Раздел) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Найти(Раздел) = Неопределено Тогда
		СоздатьРазделВнешнихСистем(Раздел);
	КонецЕсли;
	
	СоздатьЭлементыВнешнейСистемы(ВнешняяСистема, Раздел);
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет на форму динамические элементы внешних систем.
//
Процедура СоздатьЭлементыВнешнейСистемы(ВнешняяСистема, Раздел)
	
	Если ЗначениеЗаполнено(ТаблицаВнешнихСистем.НайтиСтроки(Новый Структура("ВнешняяСистема", ВнешняяСистема))) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРаздела		 = НайтиСоздатьСтрокуРаздела(Раздел);
	ГруппаВнешнейСистемы = СоздатьГруппуВнешнейСистемы(СтрокаРаздела);
	
	СоздатьДекорациюКартинка(ВнешняяСистема, ГруппаВнешнейСистемы);
	СоздатьДекорациюОписание(ВнешняяСистема, ГруппаВнешнейСистемы);
	//ДобавитьКнопкиУправления(ВнешняяСистема, ГруппаВнешнейСистемы);
	ДобавитьКнопкуНастройки(ГруппаВнешнейСистемы);
	
	НоваяСтрока					 = ЭтотОбъект.ТаблицаВнешнихСистем.Добавить();
	НоваяСтрока.ВнешняяСистема	 = ВнешняяСистема;
	НоваяСтрока.ИмяЭлементаФормы = ГруппаВнешнейСистемы.Имя;
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет на форму динамические элементы внешних систем.
//
Процедура СоздатьРазделВнешнихСистем(Раздел)
	
	НовыйРаздел		 = Элементы.Добавить(Раздел, Тип("ГруппаФормы"), Элементы.ГруппаРазделы);
	НовыйРаздел.Вид	 = ВидГруппыФормы.ОбычнаяГруппа;
	ЗаполнитьЗначенияСвойств(НовыйРаздел, Элементы.РазделДляКопирования,, "ПутьКДаннымЗаголовка, Заголовок, Видимость");
	
	НовыйРаздел.Заголовок = ПолучитьЗаголовокРаздела(Раздел);
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет на форму динамические элементы внешних систем.
//
Функция НайтиСоздатьСтрокуРаздела(Раздел)
	
	ИндексСтроки = 0;
	Для Каждого СтрокаРаздела Из Элементы[Раздел].ПодчиненныеЭлементы Цикл
		Если СтрокаРаздела.ПодчиненныеЭлементы.Количество() < 4 Тогда // количество внешних систем в строке
			Возврат СтрокаРаздела;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат СоздатьСтрокуРаздела(Раздел, ИндексСтроки);
	
КонецФункции

&НаСервере
// Процедура, добавляет на форму динамические элементы внешних систем.
//
Функция СоздатьСтрокуРаздела(Раздел, ИндексСтроки)
	
	НоваяСтрока		 = Элементы.Добавить(Раздел + "_Строка_" + ИндексСтроки, Тип("ГруппаФормы"), Элементы[Раздел]);
	НоваяСтрока.Вид	 = ВидГруппыФормы.ОбычнаяГруппа;
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Элементы.РазделДляКопирования_Строка_0,, "ПутьКДаннымЗаголовка, Видимость");
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаСервере
// Процедура, добавляет на форму динамические элементы внешних систем.
//
Функция СоздатьГруппуВнешнейСистемы(СтрокаРаздела)
	
	ГруппаВнешнейСистемы	 = Элементы.Добавить(СтрокаРаздела.Имя + "_Элемент_" + СтрокаРаздела.ПодчиненныеЭлементы.Количество(), Тип("ГруппаФормы"), СтрокаРаздела);
	ГруппаВнешнейСистемы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЗаполнитьЗначенияСвойств(ГруппаВнешнейСистемы, Элементы.РазделДляКопирования_Строка_0_Элемент_0,, "ПутьКДаннымЗаголовка, Видимость");
	
	Возврат ГруппаВнешнейСистемы;
	
КонецФункции

&НаСервере
// Процедура, добавляет на форму динамические элементы внешних систем.
//
Процедура СоздатьДекорациюКартинка(ВнешняяСистема, ГруппаРодитель)
	
	Декорация	  = Элементы.Добавить(ГруппаРодитель.Имя + "_ДекорацияКартинка", Тип("ДекорацияФормы"), ГруппаРодитель);
	Декорация.Вид = ВидДекорацииФормы.Картинка;
	ЗаполнитьЗначенияСвойств(Декорация, Элементы.РазделДляКопирования_Строка_0_Элемент_0_ДекорацияКартинка,, "Картинка, Видимость");
	
	Декорация.Картинка = ПолучитьКартинкуВнешнейСистемы(ВнешняяСистема.ТипВнешнейСистемы);
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет на форму динамические элементы внешних систем.
//
Процедура СоздатьДекорациюОписание(ВнешняяСистема, ГруппаРодитель)
	
	Декорация	  = Элементы.Добавить(ГруппаРодитель.Имя + "_ДекорацияНадпись", Тип("ДекорацияФормы"), ГруппаРодитель);
	Декорация.Вид = ВидДекорацииФормы.Надпись;
	ЗаполнитьЗначенияСвойств(Декорация, Элементы.РазделДляКопирования_Строка_0_Элемент_0_ДекорацияНадпись,, "Заголовок, Видимость");
	
	Декорация.Заголовок = ПолучитьОписаниеВнешнейСистемы(ВнешняяСистема);
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет на форму динамические элементы кнопок.
//
Процедура ДобавитьКнопкиУправления(ВнешняяСистема, ГруппаРодитель)
	
	ГруппаКнопокУправления		 = Элементы.Добавить(ГруппаРодитель.Имя + "_КнопкиУправления", Тип("ГруппаФормы"), ГруппаРодитель);
	ГруппаКнопокУправления.Вид	 = ВидГруппыФормы.ОбычнаяГруппа;
	ЗаполнитьЗначенияСвойств(ГруппаКнопокУправления, Элементы.РазделДляКопирования_Строка_0_Элемент_0_КнопкиУправления,, "ПутьКДаннымЗаголовка, Видимость");
	
	ГруппаКнопкиУдалить		 = Элементы.Добавить(ГруппаРодитель.Имя + "_ГруппаУдалить", Тип("ГруппаФормы"), ГруппаКнопокУправления);
	ГруппаКнопкиУдалить.Вид	 = ВидГруппыФормы.ОбычнаяГруппа;
	ЗаполнитьЗначенияСвойств(ГруппаКнопкиУдалить, Элементы.РазделДляКопирования_Строка_0_Элемент_0_ГруппаУдалить,, "ПутьКДаннымЗаголовка, Видимость");
	
	КнопкаУдалить			 = Элементы.Добавить(ГруппаРодитель.Имя + "_КнопкаУдалить", Тип("КнопкаФормы"), ГруппаКнопкиУдалить);
	КнопкаУдалить.Вид		 = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаУдалить.Заголовок	 = ?(ВнешняяСистема.ПометкаУдаления, НСтр("ru = 'Удалена'; en = 'Removed'"), НСтр("ru = 'Удалить'; en = 'Delete'"));
	ЗаполнитьЗначенияСвойств(КнопкаУдалить, Элементы.РазделДляКопирования_Строка_0_Элемент_0_КнопкаУдалить,, "Видимость, Заголовок");
	
	ГруппаКнопкиОтключить		 = Элементы.Добавить(ГруппаРодитель.Имя + "_ГруппаОтключить", Тип("ГруппаФормы"), ГруппаКнопокУправления);
	ГруппаКнопкиОтключить.Вид	 = ВидГруппыФормы.ОбычнаяГруппа;
	ЗаполнитьЗначенияСвойств(ГруппаКнопкиОтключить, Элементы.РазделДляКопирования_Строка_0_Элемент_0_ГруппаОтключить,, "ПутьКДаннымЗаголовка, Видимость");
	
	КнопкаОтключить				 = Элементы.Добавить(ГруппаРодитель.Имя + "_КнопкаОтключить", Тип("КнопкаФормы"), ГруппаКнопкиОтключить);
	КнопкаОтключить.Вид			 = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаОтключить.Заголовок	 = ?(ВнешняяСистема.Используется, НСтр("ru = 'Отключить'; en = 'Disable'"), НСтр("ru = 'Включить'; en = 'Enable'"));
	ЗаполнитьЗначенияСвойств(КнопкаОтключить, Элементы.РазделДляКопирования_Строка_0_Элемент_0_КнопкаОтключить,, "Видимость, Заголовок");
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет на форму динамические элементы внешних систем.
//
Процедура ДобавитьКнопкуНастройки(ГруппаРодитель)
	
	ГруппаКнопки	 = Элементы.Добавить(ГруппаРодитель.Имя + "_ГруппаНастройки", Тип("ГруппаФормы"), ГруппаРодитель);
	ГруппаКнопки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЗаполнитьЗначенияСвойств(ГруппаКнопки, Элементы.РазделДляКопирования_Строка_0_Элемент_0_ГруппаНастройки,, "ПутьКДаннымЗаголовка, Видимость");
	
	Кнопка		 = Элементы.Добавить(ГруппаРодитель.Имя + "_КнопкаНастройки", Тип("КнопкаФормы"), ГруппаКнопки);
	Кнопка.Вид	 = ВидКнопкиФормы.ОбычнаяКнопка;
	ЗаполнитьЗначенияСвойств(Кнопка, Элементы.РазделДляКопирования_Строка_0_Элемент_0_КнопкаНастройки,, "Видимость");
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
// Процедура, обработчик асинхронного события.
//
Процедура ПослеВопросаОбУдаленииОтключении(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПослеВопросаОбУдаленииОтключенииСервер(ДополнительныеПараметры.Действие, ДополнительныеПараметры.ДанныеВнешнейСистемы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик асинхронного события на сервере.
//
Процедура ПослеВопросаОбУдаленииОтключенииСервер(Действие, ДанныеВнешнейСистемы)
	
	Если Действие = "Удалить" Тогда
		ПометитьНаУдаление(ДанныеВнешнейСистемы);
	ИначеЕсли Действие = "Отключить" Тогда
		УстановитьАктивность(ДанныеВнешнейСистемы);
	КонецЕсли;
	
	ОбновитьЗаголовкиЭлементов(ДанныеВнешнейСистемы);
	
КонецПроцедуры

&НаСервере
// Процедура, обновляет заголовки элементов и данные в таблице ВС.
//
Процедура ОбновитьЗаголовкиЭлементов(ДанныеВнешнейСистемы)
	
	Если Не ЗначениеЗаполнено(ДанныеВнешнейСистемы) Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ДанныеВнешнейСистемы) = Тип("СправочникСсылка.ВнешниеСистемы") Тогда
		ДанныеВнешнейСистемы = ПолучитьДанныеВСПоВнешнейСистеме(ДанныеВнешнейСистемы);
	КонецЕсли;
	
	//Элементы[ДанныеВнешнейСистемы.ИмяЭлементаФормы + "_КнопкаУдалить"].Заголовок = ?(ДанныеВнешнейСистемы.ВнешняяСистема.ПометкаУдаления, НСтр("ru = 'Удалена'"), НСтр("ru = 'Удалить'"));
	//Элементы[ДанныеВнешнейСистемы.ИмяЭлементаФормы + "_КнопкаОтключить"].Заголовок = ?(ДанныеВнешнейСистемы.ВнешняяСистема.Используется, НСтр("ru = 'Отключить'"), НСтр("ru = 'Включить'"));
	Элементы[ДанныеВнешнейСистемы.ИмяЭлементаФормы + "_ДекорацияНадпись"].Заголовок	 = ДанныеВнешнейСистемы.ВнешняяСистема.Наименование;
	
КонецПроцедуры

&НаСервере
// Функция, возвращает данные из таблицы внешних систем.
//
Функция ПолучитьДанныеВСПоВнешнейСистеме(ВнешняяСистема)
	
	МассивСтрок = ТаблицаВнешнихСистем.НайтиСтроки(Новый Структура("ВнешняяСистема", ВнешняяСистема));
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Новый Структура("ВнешняяСистема, ИмяЭлементаФормы", МассивСтрок[0].ВнешняяСистема, МассивСтрок[0].ИмяЭлементаФормы);
	КонецЕсли;
	
КонецФункции

&НаСервере
// Функция, возвращает данные из таблицы внешних систем.
//
Функция ПолучитьДанныеВСПоИмениЭлемента(ИмяЭлемента)
	
	ИмяЭлементаВТаблице = Лев(ИмяЭлемента, СтрНайти(ИмяЭлемента, "_", НаправлениеПоиска.СКонца) - 1);
	МассивСтрок = ТаблицаВнешнихСистем.НайтиСтроки(Новый Структура("ИмяЭлементаФормы", ИмяЭлементаВТаблице));
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Новый Структура("ВнешняяСистема, ИмяЭлементаФормы", МассивСтрок[0].ВнешняяСистема, МассивСтрок[0].ИмяЭлементаФормы);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПометитьНаУдаление(ДанныеВнешнейСистемы)
	
	ВнешняяСистемаОбъект = ДанныеВнешнейСистемы.ВнешняяСистема.ПолучитьОбъект();
	ВнешняяСистемаОбъект.УстановитьПометкуУдаления(Не ДанныеВнешнейСистемы.ВнешняяСистема.ПометкаУдаления);
	
	Попытка
		ВнешняяСистемаОбъект.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, устанавливает признак использования внешней системы.
//
Процедура УстановитьАктивность(ДанныеВнешнейСистемы)
	
	ВнешняяСистемаОбъект = ДанныеВнешнейСистемы.ВнешняяСистема.ПолучитьОбъект();
	ВнешняяСистемаОбъект.Используется = Не ДанныеВнешнейСистемы.ВнешняяСистема.Используется;
	
	Попытка
		ВнешняяСистемаОбъект.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает все внешние системы.
//
Функция ПолучитьВнешниеСистемы()
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК ВнешняяСистема
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	НЕ ВнешниеСистемы.ПометкаУдаления");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВнешняяСистема");
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает заголовок для группы раздела.
//
Функция ПолучитьЗаголовокРаздела(Раздел)
	
	Если Раздел = "МобильныеПриложения" Тогда
		Возврат НСтр("ru = 'Мобильные приложения'; en = 'Mobile applications'");
	ИначеЕсли Раздел = "ИсточникиЛидов" Тогда
		Возврат НСтр("ru = 'Источники лидов'; en = 'Sources of leads'");
	ИначеЕсли Раздел = "СквознаяАналитика" Тогда
		Возврат НСтр("ru = 'Сквозная аналитика'; en = 'End-to-end analytics'");
	ИначеЕсли Раздел = "ЭлектронныеКарты" Тогда
		Возврат НСтр("ru = 'Электронные карты'; en = 'Electronic cards'");
	ИначеЕсли Раздел = "ОнлайнЗапись" Тогда
		Возврат НСтр("ru = 'Онлайн-запись'; en = 'Online recording'");
	ИначеЕсли Раздел = "Мессенджеры" Тогда
		Возврат НСтр("ru = 'Мессенджеры'; en = 'Messengers'");
	ИначеЕсли Раздел = "Телефония" Тогда
		Возврат НСтр("ru = 'Телефония'; en = 'Telephony'");
	ИначеЕсли Раздел = "Прочее" Тогда
		Возврат НСтр("ru = 'Прочее'; en = 'Other'");
	Иначе
		Возврат Раздел;
	КонецЕсли;	
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает картинку внешней системы.
//
Функция ПолучитьКартинкуВнешнейСистемы(ТипВнешнейСистемы)
	
	Возврат Справочники.ВнешниеСистемы.ПолучитьКартинкуВнешнейСистемы(ТипВнешнейСистемы);
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает имя раздела внешней системы.
//
Функция ПолучитьРазделВнешнейСистемы(ТипВнешнейСистемы)
	
	Возврат Справочники.ВнешниеСистемы.ПолучитьРазделВнешнейСистемы(ТипВнешнейСистемы);
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает описание внешней системы.
//
Функция ПолучитьОписаниеВнешнейСистемы(ВнешняяСистема)
	
	Возврат ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВнешняяСистема, "Наименование");
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает значение реквизита внешней системы.
//
Функция ПолучитьЗначениеРеквизитаВнешнейСистемы(ВнешняяСистема, Реквизит)
	
	Возврат ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВнешняяСистема, Реквизит);
	
КонецФункции

&НаСервере
// Процедура, добавляет на форму динамические элементы внешних систем.
//
Процедура УдалитьЭлементыВнешнейСистемы(ВнешняяСистема, Раздел)
	
	ЭтотОбъект.ТаблицаВнешнихСистем.Очистить();
	
	ИсключаемыеЭлементы = Новый Массив;                         
	ИсключаемыеЭлементы.Добавить(Элементы.ГруппаРазделы);
	ИсключаемыеЭлементы.Добавить(Элементы.РазделДляКопирования);
	ИсключаемыеЭлементы.Добавить(Элементы.РазделДляКопирования_Строка_0);
	ИсключаемыеЭлементы.Добавить(Элементы.РазделДляКопирования_Строка_0_Элемент_0);
	ИсключаемыеЭлементы.Добавить(Элементы.РазделДляКопирования_Строка_0_Элемент_0_ДекорацияКартинка);
	ИсключаемыеЭлементы.Добавить(Элементы.РазделДляКопирования_Строка_0_Элемент_0_ДекорацияНадпись);
	ИсключаемыеЭлементы.Добавить(Элементы.РазделДляКопирования_Строка_0_Элемент_0_КнопкиУправления);
    ИсключаемыеЭлементы.Добавить(Элементы.РазделДляКопирования_Строка_0_Элемент_0_ГруппаУдалить);
	ИсключаемыеЭлементы.Добавить(Элементы.РазделДляКопирования_Строка_0_Элемент_0_КнопкаУдалить);
	ИсключаемыеЭлементы.Добавить(Элементы.РазделДляКопирования_Строка_0_Элемент_0_ГруппаОтключить);
    ИсключаемыеЭлементы.Добавить(Элементы.РазделДляКопирования_Строка_0_Элемент_0_КнопкаОтключить);
	ИсключаемыеЭлементы.Добавить(Элементы.РазделДляКопирования_Строка_0_Элемент_0_ГруппаНастройки);
	ИсключаемыеЭлементы.Добавить(Элементы.РазделДляКопирования_Строка_0_Элемент_0_КнопкаНастройки);
	
	УправлениеИнтерфейсамиСервер.УдалитьПодчиненныеЭлементыГруппы(ЭтаФорма, Элементы.ГруппаРазделы, ИсключаемыеЭлементы);

КонецПроцедуры 

#КонецОбласти
